<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Rainbow and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.stefanhirt.munki.OpenRainbow</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps</string>
		<key>NAME</key>
		<string>Rainbow</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Rainbow by Alcatel-Lucent Enterprise is a communications and telephony solution that connects your employees and your business ecosystem, simplifies your communications and secures your data.</string>
			<key>developer</key>
			<string>Alcatel Lucent Enterprise</string>
			<key>display_name</key>
			<string>Rainbow</string>
			<key>name</key>
			<string>Rainbow</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.markkenny.autopkg.download.Rainbow</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>